first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sammys"], ["email", "sammys@halal.com"], ["created_at", "2019-09-02 19:13:12.949209"], ["updated_at", "2019-09-02 19:13:12.949209"]]
---
  def create
    user = User.new(user_params)
    if user.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "changed"], ["email", "jimy_short_changed"], ["updated_at", "2019-09-02 19:37:01.021357"], ["id", 4]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)